In [1]:
import pandas as pd

In [38]:
purchase = pd.read_csv('lv2-2305-5.csv')

In [39]:
purchase.shape

(30308, 7)

In [40]:
purchase.head()

   USER_ID  PRD_CAT     PRD_ID GENDER AGE_GRP  MARITAL_YN  PUR_AMT
0  1001395        1  P00270942      M   26-35           1    11535
1  1001004        3  P00004842      M   26-35           0     5724
2  1000819        1  P00036842      M   36-45           0    11787
3  1001611        1  P00127742      M   26-35           0     8125
4  1000438        1  P00129342      M   18-25           0    19096

# Q1

### 1-1

In [44]:
df1 = purchase.pivot_table(values=['PUR_AMT'], columns=['PRD_CAT'], index=['USER_ID', 'MARITAL_YN'], aggfunc='sum', fill_value=0).reset_index()

In [45]:
df1.head()

         USER_ID MARITAL_YN PUR_AMT
PRD_CAT                           1      2      3
0        1000003          0  162439  29054  10906
1        1000004          1  205987      0      0
2        1000005          1  104097  12841  10851
3        1000006          0   93457  35997  59314
4        1000007          1  158969      0      0

In [46]:
df1.columns = ['USER_ID', 'MARITAL_YN', 'CAT1_AMT', 'CAT2_AMT','CAT3_AMT']

In [47]:
df1.head()

   USER_ID  MARITAL_YN  CAT1_AMT  CAT2_AMT  CAT3_AMT
0  1000003           0    162439     29054     10906
1  1000004           1    205987         0         0
2  1000005           1    104097     12841     10851
3  1000006           0     93457     35997     59314
4  1000007           1    158969         0         0

### 1-2

In [76]:
from scipy.stats import pearsonr

In [87]:
df1[df1['MARITAL_YN'] == 0].loc[:, ['CAT1_AMT', 'CAT2_AMT','CAT3_AMT']].corr()

          CAT1_AMT  CAT2_AMT  CAT3_AMT
CAT1_AMT  1.000000  0.728646  0.553856
CAT2_AMT  0.728646  1.000000  0.650382
CAT3_AMT  0.553856  0.650382  1.000000

In [88]:
df1[df1['MARITAL_YN'] == 1].loc[:, ['CAT1_AMT', 'CAT2_AMT','CAT3_AMT']].corr()

          CAT1_AMT  CAT2_AMT  CAT3_AMT
CAT1_AMT  1.000000  0.695264  0.509462
CAT2_AMT  0.695264  1.000000  0.709962
CAT3_AMT  0.509462  0.709962  1.000000

### 1-3

In [89]:
A = 0.728646
B = 0.509462
C = abs(A - B)

### Q1 Answer

In [90]:
round(C, 3)

0.219

# Q2

### 2-1

In [91]:
purchase.head()

   USER_ID  PRD_CAT     PRD_ID GENDER AGE_GRP  MARITAL_YN  PUR_AMT
0  1001395        1  P00270942      M   26-35           1    11535
1  1001004        3  P00004842      M   26-35           0     5724
2  1000819        1  P00036842      M   36-45           0    11787
3  1001611        1  P00127742      M   26-35           0     8125
4  1000438        1  P00129342      M   18-25           0    19096

In [94]:
df2 = purchase.pivot_table(values=['PUR_AMT'], columns=['AGE_GRP'], index=['PRD_ID'], aggfunc='sum', fill_value=0).reset_index()

In [95]:
df2.head()

            PRD_ID PUR_AMT
AGE_GRP              18-25   26-35   36-45   46-50  51-55
0        P00000142  532314  857816  410458  110167  78328
1        P00000242  163997  254667  124015   88333  22685
2        P00000642  370517  574747  175068   47192  39675
3        P00000842   26105       0       0       0      0
4        P00000942   64393   51194   50653       0      0

In [96]:
df2.columns = ['PRD_ID', 'AGE1_AMT', 'AGE2_AMT', 'AGE3_AMT', 'AGE4_AMT', 'AGE5_AMT']

In [97]:
df2.head()

      PRD_ID  AGE1_AMT  AGE2_AMT  AGE3_AMT  AGE4_AMT  AGE5_AMT
0  P00000142    532314    857816    410458    110167     78328
1  P00000242    163997    254667    124015     88333     22685
2  P00000642    370517    574747    175068     47192     39675
3  P00000842     26105         0         0         0         0
4  P00000942     64393     51194     50653         0         0

### 2-2

In [98]:
from sklearn.preprocessing import StandardScaler

In [100]:
for i in range(1,6):
    df2['AGE' + str(i) + '_AMT_Z'] = StandardScaler().fit_transform(X=df2[['AGE' + str(i) + '_AMT']])

In [101]:
df2.head()

,PRD_ID,AGE1_AMT,AGE2_AMT,AGE3_AMT,AGE4_AMT,AGE5_AMT,AGE1_AMT_Z,AGE2_AMT_Z,AGE3_AMT_Z,AGE4_AMT_Z,AGE5_AMT_Z
0,P00000142,532314,857816,410458,110167,78328,2.244283,2.134885,2.046374,1.206063,0.793814
1,P00000242,163997,254667,124015,88333,22685,0.166760,0.082540,0.106051,0.840197,-0.218397
2,P00000642,370517,574747,175068,47192,39675,1.331654,1.171681,0.451877,0.150810,0.090671
3,P00000842,26105,0,0,0,0,-0.611031,-0.784019,-0.734008,-0.639972,-0.631063
4,P00000942,64393,51194,50653,0,0,-0.395064,-0.609820,-0.390892,-0.639972,-0.631063

### 2-3

In [102]:
from sklearn.cluster import KMeans

In [103]:
model = KMeans(n_clusters=3, init='random', n_init=50,  random_state=1234).fit(X=df2.iloc[:, -5:])

In [104]:
pred = model.predict(X=df2.iloc[:, -5:])

In [105]:
pred

array([2, 1, 2, 1, 1, 2, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1,
       1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 0, 2, 2, 1, 1, 1, 2, 1, 2, 1, 2, 1, 1, 1, 2, 2, 1, 0,
       1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 0, 1, 1, 1, 1, 2,
       1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 2,
       0, 2, 2, 1, 2, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 2, 2, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0,
       1, 1, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1, 1, 1, 2, 1, 1, 2, 1, 1, 2, 2,
       2, 1, 1, 1, 0, 0, 0, 0, 2, 2, 1, 0, 0, 2, 1, 1, 2, 0, 2, 1, 2, 0,
       2, 1, 2, 1, 2, 1, 1, 2, 1, 2, 2, 0, 1, 2, 2, 1, 2, 1, 2, 2, 2, 1,
       2, 2, 2, 2, 1, 1, 1, 1, 1, 2, 1, 1, 2, 1, 2, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 2, 2, 1, 1, 1, 2, 0, 1, 2, 1, 1, 1,
       1, 2, 1, 1, 1, 1, 2, 2, 1, 1, 1, 1, 1, 2, 1, 1, 1, 2, 1, 2, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 2, 1, 1, 1, 1, 1, 1, 1, 2, 1, 2, 1, 1, 1, 2, 2, 1, 2, 2, 2, 1,
       2, 2, 1, 2, 2, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 2, 1, 1, 2,
       2, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 2, 2, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 2, 2, 1, 1, 1, 1, 2, 1, 2, 2,
       1, 1, 1, 1, 1, 1, 2, 1, 2, 1, 1, 1, 2, 1, 1, 1, 1, 1, 2, 1, 1, 1,
       1, 1, 2, 2, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 2, 2, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0,
       1, 1, 1, 1, 1, 1, 1, 2, 1, 0, 2, 2, 1, 1, 2, 1, 2, 2, 2, 1, 1, 1,
       2, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2,
       1, 1, 1, 2, 2, 1, 1, 1, 2, 1, 1, 1, 1, 2, 0, 1, 2, 2, 2, 2, 1, 1,
       1, 1, 2, 1, 2, 1, 2, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2,
       1, 2, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 1, 1,
       0, 1, 1, 1, 1, 1, 1, 2, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2,
       2, 2, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 1, 2, 1, 2, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1,
       1, 1, 1], dtype=int32)

In [106]:
df2['LABEL'] = pred

### 2-4

In [114]:
df2.head()

,PRD_ID,AGE1_AMT,AGE2_AMT,AGE3_AMT,AGE4_AMT,AGE5_AMT,AGE1_AMT_Z,AGE2_AMT_Z,AGE3_AMT_Z,AGE4_AMT_Z,AGE5_AMT_Z,LABEL
0,P00000142,532314,857816,410458,110167,78328,2.244283,2.134885,2.046374,1.206063,0.793814,2
1,P00000242,163997,254667,124015,88333,22685,0.166760,0.082540,0.106051,0.840197,-0.218397,1
2,P00000642,370517,574747,175068,47192,39675,1.331654,1.171681,0.451877,0.150810,0.090671,2
3,P00000842,26105,0,0,0,0,-0.611031,-0.784019,-0.734008,-0.639972,-0.631063,1
4,P00000942,64393,51194,50653,0,0,-0.395064,-0.609820,-0.390892,-0.639972,-0.631063,1

In [118]:
df2.groupby('LABEL')['AGE3_AMT'].mean()

LABEL
0    646635.166667
1     45823.413084
2    247128.722973
Name: AGE3_AMT, dtype: float64

### Q2 Answer

In [119]:
round(45823.413084)

45823

# Q3

In [153]:
purchase.head()

   USER_ID  PRD_CAT     PRD_ID GENDER AGE_GRP  MARITAL_YN  PUR_AMT
0  1001395        1  P00270942      M   26-35           1    11535
1  1001004        3  P00004842      M   26-35           0     5724
2  1000819        1  P00036842      M   36-45           0    11787
3  1001611        1  P00127742      M   26-35           0     8125
4  1000438        1  P00129342      M   18-25           0    19096

In [154]:
df3 = purchase.pivot_table(values=['PUR_AMT'], index=['USER_ID', 'GENDER', 'AGE_GRP', 'MARITAL_YN'], aggfunc='sum', fill_value=0).reset_index()
df3.head()

   USER_ID GENDER AGE_GRP  MARITAL_YN  PUR_AMT
0  1000003      M   26-35           0   202399
1  1000004      M   46-50           1   205987
2  1000005      M   26-35           1   127789
3  1000006      F   51-55           0   188768
4  1000007      M   36-45           1   158969

In [155]:
df3_detail = purchase.pivot_table(values=['PUR_AMT'], columns=['PRD_CAT'], index=['USER_ID'], aggfunc='sum', fill_value=0).reset_index()

In [156]:
df3_detail.head()

         USER_ID PUR_AMT
PRD_CAT                1      2      3
0        1000003  162439  29054  10906
1        1000004  205987      0      0
2        1000005  104097  12841  10851
3        1000006   93457  35997  59314
4        1000007  158969      0      0

In [157]:
df3_detail.columns = ['USER_ID', '1', '2', '3']

In [158]:
df3_detail.head()

   USER_ID       1      2      3
0  1000003  162439  29054  10906
1  1000004  205987      0      0
2  1000005  104097  12841  10851
3  1000006   93457  35997  59314
4  1000007  158969      0      0

In [161]:
df3_detail['MAX'] = df3_detail.loc[:, ['1', '2', '3']].idxmax(axis=1)

In [162]:
df3_detail.head()

   USER_ID       1      2      3 MAX
0  1000003  162439  29054  10906   1
1  1000004  205987      0      0   1
2  1000005  104097  12841  10851   1
3  1000006   93457  35997  59314   1
4  1000007  158969      0      0   1